Ran Plan for 3 projects:

1. project: `authhub-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `authhub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `authhub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
---

### 1. project: `authhub-ecr-prod` dir: `terraform/ecr` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.ecr_web_api.data.aws_caller_identity.current: Reading...
module.ecr_web_api.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr_web_api.aws_ecr_lifecycle_policy.this[0] will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 tagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                              + "prod",
                              + "latest",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images after 7 days"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 7
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "authhub-web-api-prod"
    }

  # module.ecr_web_api.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "authhub-web-api-prod"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-authhub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }
      + tags_all             = {
          + "Component"   = "container-registry"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "ecr-authhub-web-api-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_web_api.aws_ecr_repository_policy.default[0] will be created
+ resource "aws_ecr_repository_policy" "default" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::646886795421:root"
                        }
                      + Sid       = "AllowPushPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "authhub-web-api-prod"
    }

  # module.ecr_web_api.aws_ssm_parameter.repository-url[0] will be created
+ resource "aws_ssm_parameter" "repository-url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "ECR repository URL for authhub-web-api-prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/ecr/authhub-web-api-prod-repository-url"
      + tags           = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }
      + tags_all       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-web-api"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ web_api_repository_arn = (known after apply)
+ web_api_repository_url = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecr-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fecr%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecr-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 2. project: `authhub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "authhub-cluster-prod"
      + tags     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-ecs-cluster"
        }
      + tags_all = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-cluster-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-ecs-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "authhub-cluster-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # aws_ssm_parameter.cluster_arn will be created
+ resource "aws_ssm_parameter" "cluster_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub ECS cluster ARN"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/ecs/cluster-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "authhub-ecs-cluster-arn"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-ecs-cluster-arn"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.cluster_name will be created
+ resource "aws_ssm_parameter" "cluster_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub ECS cluster name"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/ecs/cluster-name"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "authhub-ecs-cluster-name"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-ecs-cluster-name"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "authhub-cluster-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-ecs-cluster-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 3. project: `authhub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for ElastiCache Redis"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Redis from ECS tasks"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "authhub-redis-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_ssm_parameter.redis_endpoint will be created
+ resource "aws_ssm_parameter" "redis_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub Redis endpoint"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/elasticache/redis-endpoint"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "authhub-redis-endpoint"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-endpoint"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.redis_port will be created
+ resource "aws_ssm_parameter" "redis_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AuthHub Redis port"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/authhub/elasticache/redis-port"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "authhub-redis-port"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-port"
          + "Project"     = "authhub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.redis.aws_cloudwatch_metric_alarm.connections[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "connections" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache authhub-redis-prod - Connection count is too high"
      + alarm_name                            = "authhub-redis-prod-connection-count"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "authhub-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CurrConnections"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-connections-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + threshold                             = 1000
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.cpu[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "cpu" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache authhub-redis-prod - CPU utilization is too high"
      + alarm_name                            = "authhub-redis-prod-cpu-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "authhub-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-cpu-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_cloudwatch_metric_alarm.memory[0] will be created
+ resource "aws_cloudwatch_metric_alarm" "memory" {
      + actions_enabled                       = true
      + alarm_description                     = "ElastiCache authhub-redis-prod - Memory utilization is too high"
      + alarm_name                            = "authhub-redis-prod-memory-utilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "authhub-redis-prod"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all                              = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-memory-alarm"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + threshold                             = 85
      + treat_missing_data                    = "notBreaching"
    }

  # module.redis.aws_elasticache_cluster.memcached-or-single-redis[0] will be created
+ resource "aws_elasticache_cluster" "memcached-or-single-redis" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = "single-az"
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "authhub-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:09:00-mon:10:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "authhub-redis-prod-parameter-group"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 1
      + snapshot_window            = "05:00-09:00"
      + subnet_group_name          = "authhub-redis-prod-subnet-group"
      + tags                       = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.redis.aws_elasticache_parameter_group.this[0] will be created
+ resource "aws_elasticache_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "authhub-redis-prod-parameter-group"
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-parameter-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
    }

  # module.redis.aws_elasticache_subnet_group.this will be created
+ resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "authhub-redis-prod-subnet-group"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + tags_all    = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "authhub-redis-prod-subnet-group"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "authhub"
          + "Service"     = "authhub-redis"
        }
      + vpc_id      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_id              = "authhub-redis-prod"
+ redis_port              = 6379
+ redis_security_group_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p authhub-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FAuthHub%252Fterraform%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p authhub-elasticache-prod
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```